// <-------- კალკულატორი -------#### //

/*
    აქ უნდა შევქმნათ კალკულატორი იუზერისთვის,
    თავიდან იუზერს, prompt-ით უნდა ჩააწერინოთ ხუთი რიცხვი(და იფებით უნდა დაჩეკოთ ნამდვილად ჩაწერა თუ არა რიცხვი)
    მაგ ხუთი რიცხვის შემდეგ უნდა ჩააწერინოთ რა არითმეტიკული მოქმედება გააკეთოს ჩვენმა კალკულატორმა,
    (აქ შეუძლია ჩაწეროს მარტო '-','+','*' თუ სხვა რამეს ჩაწერს ახლიდან ამოუგდეთ სანამ არ ჩაწერს ამ სამიდან ერთ-ერთს)
    ამ პრომპტებიდან ხუთი მიღებული რიცხვი უნდა ჩასეტოთ მასივში და ერთ ცვლადში უნდა გქონდეთ რა არითმეტიკული მოქმედება უნდა ჩავატაროთ(რაც იუზერი აარჩევს).
    შემდეგ უნდა შექმნათ ფუნქცია რმელიც მიიღებს 2 პარამეტრს პირვილი იქნება მასივი და მეორე არითმეტიკული მოქმედება, და მაგ ფუნქციამ არითმეტიკული მნიშვნელობის მიხედვით უნდა
    გააკეთოს გამოთვლა თუ '+' არის უნდა ყველა მასივის ელემენტი მიამატოს ერთმანეთს(მაგ. 1 + 2 + 3 + 4 + 5) თუ "*" გაამრავლოს (მაგ. 1 * 2 * 3 * 4 * 5)
*/

////// =>> კოდი დაწერეთ აქ

let number1 = prompt('ჩავწეროთ 1 რიცხვი');
let number2 = prompt('ჩავწეროთ 2 რიცხვი');
let number3 = prompt('ჩავწეროთ 3 რიცხვი');
let number4 = prompt('ჩავწეროთ 4 რიცხვი');
let number5 = prompt('ჩავწეროთ 5 რიცხვი');
let Aritmetics = prompt ('გამოვიყენოთ  - ნ + ან *');
let arr= []
let sum = 0
while (Aritmetics != '-'   && Aritmetics != '+' && Aritmetics != '*'){
    Aritmetics = prompt('try again')
    if(Aritmetics == '+'){
        arr.push(number1, number2, number3, number4, number5 )
        for (let i = 0; i< arr.length; i++){
           sum = sum + arr [i];
        }
        console.log(sum);
    } 

}









//////







// <-------- თანაკვეთა -------#### //

/*
    თქვენი დავალებაა შექმნათ ფუნცქცია რომელიც აბრუნებს ახალ მასივს, მასივი კი შედგება ამ ორი მასივის თანაკვეთისგან (რომელსაც ორივე შეიცავს)
    შექმენით ორი მასივი და გამოიყენეთ იგივე ფუნქცია რომ იპოვოთ ამ ორი მასივის თანანაკვეთა
*/

const Arr1 = [1, 23, 3, 34, 54, 6];
const Arr2 = [23, 3, 123, 34, 43, 4, 41]

const arr3 = Arr1.filter(data=>Arr2.includes(data))
console.log(arr3);

////// =>> კოდი დაწერეთ აქ



//////



// <-------- ასინქრონული ფუნქცია -------#### //

/**
 * შექმენით ასინქრონული ფუნქცია რომელიც დაითვლის ათამდე, 10 წამის განმავლობაში (1++ == 1წმ)
 */


////// =>> კოდი დაწერეთ აქ
var number = 0;
var interval;

function startTimer(){
    number++
    console.log(number);
if ( number > 10){
    EndTimer()
}

}
interval = setInterval(startTimer, 1000);
function EndTimer(){
    clearInterval(interval)
console.log(' End timer:)')
}


//////



// <-------- უდიდესი რიცხვი -------#### //

/**
 * შექმენით ისეთი ფუნქცია რომელიც დაგიბრუნებთ მიწოდებული მასივის უდიდეს რიცხვს
 */


////// =>> კოდი დაწერეთ აქ
const numbers = [27, 30, 49, 99, 130, 999];
console.log(Math.max(...numbers));



//////



// <-------- პროცენტის გამოთვლა -------#### //

/**
 *  ჩვენ ვაკეთებთ პროგრამას ბანკისთვის სადაც ადამიანს ვთავაზობთ შეიყვანოს თანხა და დროის ოდენობა (თვეში). 
 *  პროცენტი თვეების მიხედვით: 1-6 თვემდე 10%, 6-12 თვემდე 14%, 1წელზე ზემოთ 20%
 *  გამოთვალეთ სულ რამდენი იქნება გადასახდელი პროცენტთან ერთად.
 */

////// =>> კოდი დაწერეთ აქ

var money = parseInt(prompt('თანხა'));
var month= parseInt(prompt('თვეების როდენობა'));
var getaMoney= 0;getaMoney
if( month>=1 && month < 6){
    getaMoney=(money * 10)/100;
    getaMoney = money + getaMoney;
    console.log(getaMoney);

}else if (month >=6 && month <= 12){
    getaMoney= (money * 14)/100;
    getaMoney= money + getaMoney;
    console.log(getaMoney);
}else if (month >12){
    getaMoney= (money *20)/100;
    getaMoney= money + getaMoney;
    console.log(getaMoney);
}

//////